/* // task1: Виведіть стовпець чисел від 1 до 100.
let i = 0;
 while (i <= 100) {
     console.log(i);
     i++;
 }

for (let i = 0; i <= 100; i++) {
    console.log(i)
} */

/* // task2: Виведіть стовпець чисел від 11 до 33;
let i = 11;
while (i <= 33) {
    console.log(i);
    i++;
}

for (let i = 11; i <= 33; i++) {
    console.log(i)
} */

/*   // task3: За допомогою циклу знайдіть суму чисел від 1 до 100;
 let result = 0;
 for (let i = 0; i <= 100; i++) {
     result += i;
     console.log(i)
 }
 alert(result)

 let result = 0;
 let i = 0
 while (i <= 100) {
     result += i;
     i++
 }
 alert(result) */

/*  // task4: Даний масив з елементами [1, 2, 3, 4, 5]. За допомогою циклу for виведіть ці елементи на екран.
 let arr = [1, 2, 3, 4, 5];
 for (let i = 0; i < arr.length; i++) {
     alert(arr[i])
 } */


/*  // Даний масив з елементами [1, 2, 3, 4, 5]. За допомогою циклу for знайдіть суму елементів цього масиву. Запишіть її у змінну result.
let arr = [1, 2, 3, 4, 5];
let result = 0;
for (let i = 0; i < arr.length; i++) {
   result += arr[i]
}
alert(result)  */

/* // Даний об'єкт obj. За допомогою циклу for-in виведіть на екран ключі та елементи об'єкта.
let obj = {green: 'зелений', red: 'червоний', blue: 'голубий'}
for(let key in obj){
    alert(key, obj[key])
} */

/* //  Дан объект obj с ключами Mike, Vasya, Petya с элементами '200', '300', '400'. С помощью цикла for-in выведите на экран строки такого формата: 'Коля - зарплата 200 долларов.'.
let obj = {Mike: '200',Vasya: '300',Petya: '400',}
for(let key in obj){
 alert(key + ' - зарплата '+ obj[key] + ' доларів')
} */

/* // Дан массив с элементами 2, 5, 9, 15, 0, 4. С помощью цикла for и оператора if выведите на экран столбец тех элементов массива, которые больше 3-х, но меньше 10.
let arr = [2, 5, 9, 15, 0, 4]
for(let i = 0; i < arr.length;i++){
    if(arr[i]>3 && arr[i]<10){
        alert(arr[i])
    }
} */

/*  // Даний масив із числами. Числа можуть бути позитивними та негативними. Знайдіть суму позитивних елементів масиву.
let arr = [-5, 2, 6, 7, -19, 3, 2, 1]
let num = 0;
for (let i = 0; i < arr.length; i++) {
    if (arr[i] > 0) {
        num += arr[i]
    }
}
alert(num) */

/* // Даний масив з елементами 1, 2, 5, 9, 4, 13, 4, 10. За допомогою циклу for та оператора if перевірте, чи є в масиві елемент зі значенням, рівним 4. Якщо є - виведіть на екран 'Є!' і вийдіть із циклу. Якщо ні – нічого робити не треба.
let arr = [1, 2, 5, 9, 4, 13, 4, 10]
for (let i = 0; i < arr.length; i++) {
    if (arr[i] === 4) {
        alert('Є')
    }
} */

/* // Даний масив числами, наприклад: [10, 20, 30, 50, 235, 3000]. Виведіть на екран лише ті числа з масиву, які починаються на цифру 1, 2 чи 5.
 let arr = [10, 20, 30, 50, 235, 3000];
 let str1 = arr.filter( arr => arr.toString().startsWith("1") || arr.toString().startsWith("2") || arr.toString().startsWith("5"));
 alert(str1)  */

/* // Даний масив з елементами 1, 2, 3, 4, 5, 6, 7, 8, 9. За допомогою циклу for створіть рядок '-1-2-3-4-5-6-7-8-9-'.
let arr = [1, 2, 3, 4, 5, 6, 7, 8, 9];
let str = '';
for (let i = 0; i < arr.length; i++) {
    str+=arr[i] + '-'
}
alert(str) */

 // Складіть масив днів тижня. За допомогою циклу for виведіть усі дні тижня, а вихідні дні виведіть жирним.
 let arr = [ "Mon", "Tue", "Wed", "Thu", "Fri", "Sat","Sun" ];
 let str = '';
 for (let i = 0; i < arr.length; i++) {
     if (arr[i] == 'Sun' || arr[i] == 'Sat') {
         str += ' ' + arr[i].toUpperCase();
     } else if(arr[i] === 0){
         str -= ' ';
     }else {
         str += ' ' + arr[i]
     }
 }
 alert(str)

/* // Складіть масив днів тижня. За допомогою циклу for виведіть усі дні тижня, а поточний день виведіть курсивом. Поточний день має зберігатися у змінній day.
let arr = ["Mon", "Tue", "Wed", "Thu", "Fri", "Sat", "Sun"];
let day = 'Wed';
let str = '';
for (let i = 0; i < arr.length; i++) {
    if (arr[i] === day) {
        str += ' ' + arr[i].toUpperCase();
    } else {
        str += ' ' +  arr[i]
    }
}
alert(str) */

/* // Дано число n = 1000. Ділить його на 2 стільки разів, поки результат поділу не стане меншим за 50. Яке число вийде? Порахуйте кількість ітерацій, необхідних цього (ітерація - це прохід циклу), і запишіть їх у змінну num.
let n = 1000;
let i = 0;
while (n > 50){
    n /= 2;
    i++;
}
alert(i) */