/* //task1: Дано змінні a = 10 і b = 3. Знайдіть залишок від поділу a на b.
let a = 10;
let b = 3 ;
alert(a % b); */

/* //task2: Дано змінні a і b. Перевірте, що a ділиться без залишку на b. Якщо це так - виведіть 'Діліться' і результат розподілу, інакше виведіть 'Діліться з залишком' і залишок від розподілу.
let a = prompt('Введіть число a');
let b = prompt('Введіть число b');
let c = a % b;
if (c == 0) {
    alert('Ділиться')
} else {
    alert('Не ділиться, остача:'+ ` ${c}`)
} */

/* // task3: Зведіть 2 в 10 ступінь. Результат запишіть у змінну str.
let str = Math.pow(10, 2);

let a = prompt('Введіть число');
let b = prompt('Введіть степінь до якого потрібно піднести число');
let str = Math.pow(a, b);
alert(str) */

/* // task4: Знайдіть квадратний корінь із 245.
let a = Math.sqrt(245);
alert(a);

let a = prompt('Введіть число');
let b = Math.sqrt(a);
alert(b); */

/* // task5: Даний масив з елементами 4, 2, 5, 19, 13, 0, 10. Знайдіть квадратний корінь із суми кубів його елементів. Для вирішення скористайтесь циклом for.
let arr = [4, 2, 5, 19, 13, 0, 10];
let num = 0;
for (let i = 0; i < arr.length; i++) {
     num += Math.pow(arr[i], 3);
}
alert(Math.sqrt(num)); */

/* // task6: Знайдіть квадратний корінь із 379. Результат округліть до цілих, до десятих, до сотих.
let num = Math.sqrt(379);
alert(`${num.toPrecision(2)}, ${num.toPrecision(3)}, ${num.toPrecision(4)}`) */

/* // task7: Знайдіть квадратний корінь із 587. Округліть результат у більшу та меншу сторони, запишіть результати округлення в об'єкт із ключами 'floor' та 'ceil'.
let a = Math.sqrt(587);
let obj = {
    floor: Math.floor(a),
    ceil: Math.ceil(a)
}
alert(`${obj.floor} ${obj.ceil}`) */

/* // task8: Дано числа 4, -2, 5, 19, -130, 0, 10. Знайдіть мінімальне та максимальне число.
let num = [4, -2, 5, 19, -130, 0, 10];
let min = Math.min.apply(Math, num);
let max = Math.max.apply(Math, num);
alert(`Найменше число ${min}, Найбільше число ${max}`); */

/* // task9: Виведіть на екран випадкове ціле число від 1 до 100.
let a = Math.floor(Math.random() * 101);
alert(a); */

/* // task10: Заповніть масив 10-ма випадковими цілими числами.
let arr = [];
i = 0;
while (i < 10) {
    arr[i] = Math.floor(Math.random() * 10);
    i++;
}
alert(arr)

let arr = [];
for (let i = 0; i < 10; i++) {
    arr[i] = Math.floor(Math.random() * 10);
}
alert(arr); */

/* // task11: Дано змінні a і b. Відніміть від a змінну b і результат привласніть змінній c. Зробіть так, щоб у будь-якому випадку в змінну записалося позитивне значення. Перевірте роботу скрипту при a та b, рівних відповідно 3 та 5, 6 та 1.
let a = 3;
let b = 5;
let c = Math.abs(a-b);
alert(c); */

/* // task12: Даний масив arr. Знайдіть середнє арифметичне його елементів. Перевірте завдання на масиві з елементами 12, 15, 20, 25, 59, 79.
let arr = [12, 15, 20, 25, 59, 79];
let num = 0;
for (let i = 0; i < arr.length; i++) {
    num += arr[i]
}
let average = num / arr.length;
alert(average); */

/* // task13: Напишіть скрипт, який знаходитиме факторіал числа. Факторіал (позначається !) - Це твір (множення) всіх цілих чисел, менше цього, та його самого. Наприклад, 4! = 1 * 2 * 3 * 4.
let ask = prompt('Введіть число');
fact = 1;
for (let i = 1; i <= ask; i++) {
    fact *= i;
}
alert(fact) */























































































