/* // task1: Створіть змінну num і надайте їй значення 3. Виведіть значення цієї змінної на екран за допомогою методу alert.
let num = 3;
alert(num) */

/* //task2: Створіть змінні a=10 та b=2. Виведіть на екран їхню суму, різницю, множення та ділення (результат поділу).
let a = 10;
let b = 2;
alert(`${a + b} ${a - b} ${a * b} ${a / b}`) */


/* //task3: Створіть змінні c=15 та d=2. Підсумуйте їх, а результат надайте змінної result. Виведіть на екран значення змінної результату.
let c = 15;
let d = 2;
let result = c + d;
alert(result) */

/* //task4: Створіть змінні a=10, b=2 та c=5. Виведіть на екран їхню суму.
let a = 10;
let b = 2;
let c = 5;
alert(a + b + c) */

/* // task5:Створіть змінні a=17 та b=10. Відніміть a змінну b і результат привласніть змінній c. Потім створіть змінну d, надайте їй значення 7. Складіть змінні c і d, а результат запишіть змінну result. Виведіть на екран значення змінної результату.
let a = 17;
let b = 10;
let c = a - b;
let d = 7;
let result = c + d;
alert(result); */

/* //task6: Створіть змінну str і надайте їй значення 'Hello World!'. Виведіть значення цієї змінної на екран.
let str = 'Hello World!';
alert(str); */

/* //task7: Створіть змінні str1='Hello, ' та str2='World!'. За допомогою цих змінних та операції складання рядків виведіть на екран фразу 'Привіт, Світ!'.
let str1 = 'Hello, ';
let str2 = 'World!';
alert(str1 + str2); 

 // task8: Створіть змінну name і надайте їй ваше ім'я. Виведіть на екран фразу 'Hello, %Name%!'.
/* let name = 'Marian';
alert(`'Hello, ' ${name}`)  */

/* // task9: Створіть змінну age та привласніть їй ваш вік. Виведіть на екран 'Мені Вік% років!'.
let age = 16;
alert('Мені ' + age + ' років!') */

/* // task10: Запитайте ім'я користувача за допомогою методів prompt. Виведіть за допомогою alert повідомлення 'Ваше ім'я %ім'я%'.
let name = prompt('Your name')
alert('Your name: ' + name) */

/* // task11: Запитайте у користувача число. Виведіть за допомогою alert квадрат цього числа.
let num = prompt('Number')
alert(num * num); */

/* // task12: Створіть змінну str і дайте їй значення 'abcde'. Звертаючись до окремих символів цього рядка, виведіть на екран символ 'a', символ 'c', символ 'e'.
let str = 'abcde';
alert(str[0] )
alert(str[2])
alert(str[4]) */

/* // task13: Створіть змінну num і дайте їй значення '12345'. Знайдіть добуток (множення) цифр цього числа.
let num = '12345';
alert(num[0] * num[1] * num[2] * num[3] * num[4]) */

/* // task14: Напишіть скрипт, який рахує кількість секунд на годину, на добу, на місяці.
let second = 60;
let hour = 60;
let day = 24;
let month = 30;
alert('seconds in hour ' + second * hour)
alert('seconds in day ' + second * hour * day)
alert('seconds in month ' + second * hour * day * month) */

/* // task15: Створіть три змінні – година, хвилина, секунда. За допомогою них виведіть поточний час у форматі 'година:хвилина:секунда'.
let hour = '23:';
let minute = '32:';
let second = '37';
alert(hour + minute + second) */

/* // task16: Створіть змінну, надайте їй число. Зведіть це число у квадрат. Виведіть його на екран.
let num = 7;
let num2 = num * num;
alert(num2) */