/* // task1: Якщо змінна a дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте роботу скрипта при a, що дорівнює 1, 0, -3.
let a = 1;
if (a === 0) {
    alert('Вірно')
} else {
    alert('Невірно')
}

let a = 0;
if (a === 0) {
    alert('Вірно')
} else {
    alert('Невірно')
}

let a = -3;
if (a === 0) {
    alert('Вірно')
} else {
    alert('Невірно')
} */

/* // task2: Якщо змінна a більша за нуль, то виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте роботу скрипта при a, що дорівнює 1, 0, -3.
let a = 1;
if (a > 0) {
    alert('Вірно')
} else {
    alert('Невірно')
}

let a = 0;
if (a > 0) {
    alert('Вірно')
} else {
    alert('Невірно')
}

let a = -3;
if (a > 0) {
    alert('Вірно')
} else {
    alert('Невірно')
} */

// task3: Якщо змінна a менша за нуль, то виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте роботу скрипта при a, що дорівнює 1, 0, -3.
/* let a = 1;
if (a < 0) {
    alert('Вірно')
} else {
    alert('Невірно')
}

let a = 0;
if (a < 0) {
    alert('Вірно')
} else {
    alert('Невірно')
}

let a = -3;
if (a < 0) {
    alert('Вірно')
} else {
    alert('Невірно')
}  */

/* // task4: Якщо змінна a більша або дорівнює нулю, то виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте роботу скрипта при a, що дорівнює 1, 0, -3.
let a = 1;
if (a >= 0) {
    alert('Вірно')
} else {
    alert('Невірно')
}

let a = 0;
if (a >= 0) {
    alert('Вірно')
} else {
    alert('Невірно')
}

let a = -3;
if (a >= 0) {
    alert('Вірно')
} else {
    alert('Невірно')
}   */

/* // task5: Якщо змінна a менша або дорівнює нулю, то виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте роботу скрипта при a, що дорівнює 1, 0, -3.
let a = 1;
if (a <= 0) {
    alert('Вірно')
} else {
    alert('Невірно')
}

let a = 0;
if (a <= 0) {
    alert('Вірно')
} else {
    alert('Невірно')
}

let a = -3;
if (a <= 0) {
    alert('Вірно')
} else {
    alert('Невірно')
}    */

/* // task6: Якщо змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте роботу скрипта при a, що дорівнює 1, 0, -3.;
let a = 1;
if (a != 0) {
    alert('Вірно')
} else {
    alert('Невірно')
}

let a = 0;
if (a != 0) {
    alert('Вірно')
} else {
    alert('Невірно')
}

let a = -3;
if (a != 0) {
    alert('Вірно')
} else {
    alert('Невірно')
}     */

/* // task7: Якщо змінна a дорівнює 'test', виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте роботу скрипта при a, що дорівнює 'test', 'тест', 3.
let a = 'test';
if (a === 'test') {
    alert('Вірно')
} else {
    alert('Невірно')
}

let a = 'тест';
if (a === 'test') {
    alert('Вірно')
} else {
    alert('Невірно')
}

let a = 3;
if (a === 'test') {
    alert('Вірно')
} else {
    alert('Невірно')
} */

/* // task8: Якщо змінна a дорівнює '1' і за значенням і типом, то виведіть 'Вірно', інакше виведіть 'Неправильно'. Перевірте роботу скрипта при a, що дорівнює '1', 1, 3.
let a = '1';
if (a === '1') {
    alert('Вірно')
} else {
    alert('Невірно')
}

let a = 1;
if (a === '1') {
    alert('Вірно')
} else {
    alert('Невірно')
}

let a = 3;
if (a === '1') {
    alert('Вірно')
} else {
    alert('Невірно')
} */

/* // task9: Якщо змінна test дорівнює true, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом та з довгим.
let test = true;
if (test === true) {
    alert('Вірно')
} else {
    alert('Невірно')
}

let test = false;
if (test === true) {
    alert('Вірно')
} else {
    alert('Невірно')
}

let test = true;
let test2 = test === true ? alert("Вірно") : alert("Невірно");

let test = false;
let test2 = test === true ? alert("Вірно") : alert("Невірно"); */

/* // task10: Якщо змінна test не дорівнює true, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом та з довгим.
let test = true;
if (test != true) {
    alert("Вірно")
} else {
    alert("Невірно")
}

let test = false;
if (test != true) {
    alert("Вірно")
} else {
    alert("Невірно")
}
let test = true;
let test2 = test != true ? alert("Вірно") : alert("Невірно");

let test = false;
let test2 = test != true ? alert("Вірно") : alert("Невірно"); */

/* // task11: Якщо змінна a більша за нуль і менше 5-ти, то виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте роботу скрипта при a, що дорівнює 5, 0, -3, 2.
let a = 5;
if (a > 0 && a < 5) {
    alert('Вірно')
} else {
    alert('Невірно')
}

let a = 0;
if (a > 0 && a < 5) {
    alert('Вірно')
} else {
    alert('Невірно')
}

let a = -3;
if (a > 0 && a < 5) {
    alert('Вірно')
} else {
    alert('Невірно')
}

let a = 2;
if (a > 0 && a < 5) {
    alert('Вірно')
} else {
    alert('Невірно')
} */

// task12: Якщо змінна a дорівнює нулю або дорівнює двом, додайте до неї 7, інакше поділіть її на 10. Виведіть нове значення змінної на екран. Перевірте роботу скрипта при a, що дорівнює 5, 0, -3, 2.
/* a = 5;
if (a == 0 || a == 2) {
    alert(a + 7)
} else {
    alert(a / 10)
}

a = 0;
if (a == 0 || a == 2) {
    alert(a + 7)
} else {
    alert(a / 10)
}

let a = -3;
if (a == 0 || a == 2) {
    alert(a + 7)
} else {
    alert(a / 10)
}

let a = 2;
if (a == 0 || a == 2) {
    alert(a + 7)
} else {
    alert(a / 10)
} */

/* // task13: Якщо змінна a дорівнює або менше 1, а змінна b більша або дорівнює 3, то виведіть суму цих змінних, інакше виведіть їх різницю (результат віднімання). Перевірте роботу скрипта при a та b, що дорівнює 1 і 3, 0 і 6, 3 і 5.
let a = 1;
let b = 3;
if (a <= 1 && b >= 3) {
    alert(a + b)
} else {
    alert(a - b)
}

let a = 0;
let b = 6;
if (a <= 1 && b >= 3) {
    alert(a + b)
} else {
    alert(a - b)
}

let a = 3;
let b = 5;
if (a <= 1 && b >= 3) {
    alert(a + b)
} else {
    alert(a - b)
} */

/* // task14: Якщо змінна a більше 2-х і менше 11-ти, або змінна b більша або дорівнює 6-ти і менше 14-ти, то виведіть 'Вірно', інакше виведіть 'Невірно'.
let a = 1;
let b = 3;
if (a > 2 && a < 11 || b >= 6 && b < 14) {
    alert('Вірно')
} else {
    alert('Невірно')
}

let a = 0;
let b = 6;
if (a > 2 && a < 11 || b >= 6 && b < 14) {
    alert('Вірно')
} else {
    alert('Невірно')
}

let a = 3;
let b = 5;
if (a > 2 && a < 11 || b >= 6 && b < 14) {
    alert('Вірно')
} else {
    alert('Невірно')
} */

/* // task15: Змінна num може приймати 4 значення: 1, 2, 3 чи 4. Якщо вона має значення '1', то змінну result запишемо 'зима', якщо має значення '2' – 'весна' тощо. Розв'яжіть завдання через switch-case.
let num = 4;
switch (num) {
    case 1:
        alert('Зима');
        break;
    case 2:
        alert('Весна')
        break;
    case 3:
        alert('Літо')
        break;
    case 4:
        alert('Осінь')
        break;
} */

/* // task16: У змінній day лежить якесь число з інтервалу від 1 до 31. Визначте, у яку декаду місяця потрапляє це число (у першу, другу чи третю).
let day = 32;
if (day >= 1 && day <= 11) {
    alert('Перша декада')
} else if (day >= 12 && day <= 21) {
    alert('Друга декада')
} else if(day >= 22 && day <= 31){
    alert('Третя декада')
} else{
    alert('Не підпадає ні в одну з декад')
} */

/* // task17: У змінній month лежить якесь число з інтервалу від 1 до 12. Визначте, в яку пору року потрапляє цей місяць (зима, літо, весна, осінь).
let month = 13;
if (month >= 1 && month <= 2){
    alert('Зима')
} else if(month >= 3 && month <= 5){
    alert('Весна')
} else if(month >= 6 && month <= 8){
    alert('Літо')
} else if(month >= 9 && month <= 11){
    alert('Осінь')
} else if(month === 12){
    alert('Зима')
} else{
    alert('Не підпадає ні під одну пору року')
} */

/* // task18: Дано рядок, що складається із символів, наприклад, 'abcde'. Перевірте, що першим символом цього рядка є буква 'a'. Якщо це так - виведіть 'так', інакше виведіть 'ні'.
let letter =  'abcde';
if(letter[0] === 'a'){
    alert('Так')
} else{
    alert('Ні')
} */

/* // task19: Дано рядок із цифрами, наприклад, '12345'. Перевірте, що першим символом цього рядка є цифра 1, 2 або 3. Якщо це так - виведіть 'так', інакше виведіть 'ні'.
let numbers = '12345';
if(numbers[0,1,2] >= 3){
    alert('Так')
} else{
    alert('Ні')
} */

/* // task20: Дано рядок із 3-х цифр. Знайдіть суму цих цифр. Тобто складіть як числа перший символ рядка, другий та третій.
let num = '123';
let sum = 0;
for (let i = 0; i < num.length; i++) {
sum += +num[i];
}
alert(sum) */

// task21: Дано рядок із 6-ти цифр. Перевірте, чи сума перших трьох цифр дорівнює сумі других трьох цифр. Якщо це так - виведіть 'так', інакше виведіть 'ні'.
/* let num = '123456' // ні
let num = '123321' // так
let sum1 = 0;
let sum2 = 0;
for (let i = 0; i < num[0, 1, 2]; i++) {
    sum1 += +num[i];
}
for (let i = 0; i < num[3]; i++) {
    sum2 += +num[i];
}
if (sum1 === sum2) {
    alert('Так')
} else {
    alert('Ні')
} */